 {"content": "一只因意外失去一条前腿的青蛙，心灰意冷甚至动了轻生的念头。有一天走到一窗户前听到俩母女在吵架，女儿说：“我恐怕再也找不到比他更好的人了！”母亲笑着大声说：“三条腿的蛤蟆不好找，两条腿的男人不有的是！”青蛙一听，心里顿时平衡很多：“哇，我还是稀有物品！‘于是坚强的活了下来。’", "title": "稀有物品"}
{"content": "老王卖水果，可是生意不好，便去找大师，对大师说:\"我如此相信我的顾客，却收到好几次假钱，为什么?”大师拿出一个中间烂的苹果，老王顿悟:“大师，您是说，现在人心叵测，防人之心不可无?”“防你妹，这是我从你那买的苹果，赶紧麻溜地退钱。”", "title": "麻溜退钱"}
{"content": "母猪：“这日子没发过了，我不活了。”公猪：“别这样亲爱的，我只爱你一个，这辈子都会对你好””母猪：“你的话信得过，母猪都会上树。”公猪：“你特么能先从树上下来再说吗?”", "title": "能从树上下来再说吗？"}
{"content": "今天女神问我要语文书做笔记，然后在我书后写上～我爱你～ 接着后面画了一个～一箭穿心～的图案 还我之后 我看了看 眼睛都红了 决定牵着她的手去一个神圣的地方 …… 老师 她这个畜生 在我新书上乱画!", "title": "你没有女朋友有不是没有道理的"}
{"content": "同事想涨工资，又不好直接跟经理说，于是他暗示道：“经理，我常常梦到我月薪过万，然后找到了好的女朋友，还买了房，我要怎样才能梦想实现呢?”经理淡定地说：“少睡点觉就行。”", "title": "少睡点觉"}
{"content": "昨夜里睡的有点晚。今天的早例会，我困得不行，有点睁不开眼。会后领导拍了我一下肩膀，说我今天表现不错。可是身边的同事们都不理我。用异样的眼光看着我。我很纳闷，就问领导秘书。回答说：“你就是个马屁精，会上只有你不住点头同意领导的决策。”", "title": "马屁精"}
{"content": "一个人做任何事情，不管遇到多少困难，即使前景再渺茫，只要希望还在，只要持之以恒，总有一天会成功的!这不，观察了三个月，对面八楼的妹子终于有一次洗澡忘拉窗帘了……", "title": "这就是你偷看妹子洗澡的理由吗？"}
{"content": "一朋友是做白酒销售的，一天，他追了好久的女神对他说： “我有男朋友了，快结婚了，你别纠缠我了!” 他低下头，很痛苦的样子。突然，他两眼放光， 激动地说：“你结婚时一定要用我的酒啊!”", "title": "白酒销售"}
{"content": "前几天哥被一妹子当着众人的面强吻，当时那个羞得，恨不得找个地缝钻进去，哥突然灵机一动，睡在地上口吐泡沫，浑身颤抖。把那妹子吓得，差点晕过去，至今我还忘不了众人惊讶的表情", "title": "香水有“毒”"}
{"content": "公车上看到有一个姑娘在吐，我递给她一包纸巾关心的问她：“姑娘，你这是晕车了吗?”姑娘摆摆手跟我说：“求求你把脸拿开好吗!”", "title": "求你把脸拿开"}
{"content": "爸爸给孩子们讲起了小时候家境贫寒，经常挨饿的事。小女儿听完故事，两眼含泪，手里的蛋糕只吃了一半。她十分同情地对爸爸说：“哦，爸爸，我知道了，你是因为没有饭吃才到我们家来的，对吗？”", "title": "你是没饭吃来我家的吗"}
{"content": "一天在商场里，看见一男的抓着一女的动手动脚，骂骂咧咧，旁边还围了一圈人跟着瞎起哄。我生平最讨厌这种欺负女人的渣男！一脚将那渣男踹翻在地，道：你TM打女人算什么东西，有本事跟我打！这时，突然人群里有人喊到：这女贼的同伙来啦。", "title": "女贼同伙"}
{"content": "北京APEC会议，石家庄限行，记者在街头采访，拦下一骑电车的大叔，问：大叔，我看你骑电车出行，您对咱们单双号限行是不是很支持啊？能谈一下你的感受吗？大叔：我普通话不太好，能用石家庄话说吗？记者：可以啊！大叔：我草他娘来！北京开他娘唉匹克，该俺蛇庄啥事；北京人都在家歇大礼拜了，俺还得加班；北京夜个后晌就供暖，俺晚上还冻滴鼻涕夜个季流，我草他娘懊！记者：大叔，你还是说普通话吧！大叔：低碳环保，从我做起。", "title": "低碳环保 从我做起"}
{"content": "女人总是很善良的，对各种小动物毫无抵抗力，比如：路虎，悍马，捷豹，宝马，当然，还有天猫……", "title": "对小动物根本没有抵抗力"}
{"content": "后三定位担哪样算?计划几乎百分之98准【", "title": "后三胆码稳定玩法"}
{"content": "五星定位担哪样算?计划几乎百分之98准【", "title": "定位胆的稳定玩法"}
{"content": "五星定位担哪样算?计划几乎百分之98准【", "title": "重庆时时彩定位胆玩法"}
{"content": "小时候家里穷，洗不起澡，只能趴在窗户上看邻居家姐姐洗澡。娶不起老婆，只能睡别人家的老婆。养不起孩子，只能让隔壁帮我养。哎，命苦啊！！！", "title": "命苦！！！"}
{"content": "女儿离家上大学时，把心爱的小盆栽和金鱼留下来让我照料。但她放心不下，因为我这个做妈妈的粗心大意是出了名的。结果花草枯萎了，我把这件事告诉了她。一天她打电话回来，我很惭愧地告诉她金鱼也死了。她沉默许久，然后轻轻地问道：“爸爸还好吗？”", "title": "爸爸还好吗？"}
{"content": "A：今天我和女神表白了！B：她怎么说？A：她说：我实在是配不上你这样一个有着凌云之志的男人！B：你有什么凌云之志？A：癞蛤蟆想吃天鹅肉", "title": "凌云壮志（癞蛤蟆想吃天鹅肉）"}
